sheminasalam/Esp8266-Mqtt-Canary/ESPCanary.cpp
/*
   ESPCanary
   Create an ESP32 or ESP8266 OpenCanary Honeypot
   By AnotherMaker - https://youtube.com/AnotherMaker
   Forked and repurposed from https://github.com/nailbuster/esp8266FTPServer
   based on Jean-Michel Gallego's work
   modified to work with esp8266 SPIFFS by David Paiva (david@nailbuster.com)

   This program is free software: you can redistribute it and/or modify
   it under the terms of the GNU General Public License as published by
   the Free Software Foundation, either version 3 of the License, or
   (at your option) any later version.

   This program is distributed in the hope that it will be useful,
   but WITHOUT ANY WARRANTY; without even the implied warranty of
   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
   GNU General Public License for more details.

   You should have received a copy of the GNU General Public License
   along with this program.  If not, see <http://www.gnu.org/licenses/>.
   
   
  ///////////////////////////////////////
  //     Change Values in Lines        //
  //         184, 192-198              //
  //                                   //
  ///////////////////////////////////////
   
   
   
*/

#include "ESPCanary.h"
#ifdef ESP8266
#include <ESP8266WiFi.h>
#elif defined ESP32
#include <WiFi.h>
#include "SPIFFS.h"
#endif
#include <WiFiClient.h>
#include <FS.h>

#include <PubSubClient.h>
#include <ArduinoJson.h>
#include <WiFiClientSecure.h>

WiFiServer ftpServer( FTP_CTRL_PORT );
WiFiServer dataServer( FTP_DATA_PORT_PASV );

WiFiClient ftpClient;

//WiFiClient wifiClient;
PubSubClient mqttClient(ftpClient);

void FtpServer::begin(String uname, String pword, String canary, bool append_ip, String append_char)
{
  // Tells the ftp server to begin listening for incoming connection
  _FTP_USER = uname;
  _FTP_PASS = pword;
  _FTP_CAN = canary;
  _FTP_APPEND_IP = append_ip;
  _FTP_APPEND_CHAR = append_char;

  ftpServer.begin();
  delay(10);
  dataServer.begin();
  delay(10);
  millisTimeOut = (uint32_t)FTP_TIME_OUT * 60 * 1000;
  millisDelay = 0;
  cmdStatus = 0;
  iniVariables();
}

void FtpServer::iniVariables()
{
  // Default for data port
  dataPort = FTP_DATA_PORT_PASV;

  // Default Data connection is Active
  dataPassiveConn = true;

  // Set the root directory
  strcpy( cwdName, "/" );

  rnfrCmd = false;
  transferStatus = 0;

}

void FtpServer::handleFTP()
{
  if ((int32_t) ( millisDelay - millis() ) > 0 )
    return;

  if (ftpServer.hasClient()) {
    client.stop();
    client = ftpServer.available();
  }

  if ( cmdStatus == 0 )
  {
    if ( client.connected())
      disconnectClient();
    cmdStatus = 1;
  }
  else if ( cmdStatus == 1 )        // Ftp server waiting for connection
  {
    abortTransfer();
    iniVariables();
#ifdef FTP_DEBUG
    Serial.println("Ftp server waiting for connection on port " + String(FTP_CTRL_PORT));
#endif
    cmdStatus = 2;
  }
  else if ( cmdStatus == 2 )        // Ftp server idle
  {

    if ( client.connected() )               // A client connected
    {
      clientConnected();
      millisEndConnection = millis() + 10 * 1000 ; // wait client id during 10 s.
      cmdStatus = 3;
    }
  }
  else if ( readChar() > 0 )        // got response
  {
    if ( cmdStatus == 3 )           // Ftp server waiting for user identity
      if ( userIdentity() )
        cmdStatus = 4;
      else
        cmdStatus = 0;
    else if ( cmdStatus == 4 )      // Ftp server waiting for user registration
      if ( userPassword() )
      {
        cmdStatus = 5;
        fireCanary();
        millisEndConnection = millis() + millisTimeOut;
      }
      else
        cmdStatus = 0;
    else if ( cmdStatus == 5 )      // Ftp server waiting for user command
      if ( ! processCommand())
        cmdStatus = 0;
      else
        millisEndConnection = millis() + millisTimeOut;
  }
  else if (!client.connected() || !client)
  {
    cmdStatus = 1;
#ifdef FTP_DEBUG
    Serial.println("client disconnected");
#endif
  }

  if ( transferStatus == 1 )        // Retrieve data
  {
    if ( ! doRetrieve())
      transferStatus = 0;
  }
  else if ( transferStatus == 2 )   // Store data
  {
    if ( ! doStore())
      transferStatus = 0;
  }
  else if ( cmdStatus > 2 && ! ((int32_t) ( millisEndConnection - millis() ) > 0 ))
  {
    client.println("530 Timeout");
    millisDelay = millis() + 200;    // delay of 200 ms
    cmdStatus = 0;
  }
}

void mqttCallback(char * topic, byte * payload, unsigned int length) {

  StaticJsonDocument<256> doc;
  doc["alert"] = "OFF";
  doc["IP"] = "none";

  String message;
  serializeJson(doc, message);

  Serial.println("Publishing MQTT message:");
  Serial.println(message);
  const char* mqttTopic = "esp/canary-alert";
  // Publish the MQTT message
  mqttClient.publish(mqttTopic, message.c_str());
}

void FtpServer::fireCanary()
{
  // Define MQTT parameters
  const char* mqttServer = "Mqtt-Server";
  const int mqttPort = 1883;
  const char* mqttUsername = "mqttUsername";
  const char* mqttPassword = "mqttPassword";
  const char* mqttTopic = "esp/canary-alert";
  const char* mqttSyncTopic = "esp/canary-sync";
  const char* deviceId = "esp093441";

  Serial.print("Connection made from ");
  String remoteip = client.remoteIP().toString();
  Serial.println(remoteip);
  Serial.println("Attempting Canary");

  mqttClient.setServer(mqttServer, mqttPort);
  mqttClient.setCallback(mqttCallback);

  while (!mqttClient.connected()) {
    Serial.println("Connecting to MQTT server...");

    if (mqttClient.connect(deviceId, mqttUsername, mqttPassword)) {
      Serial.println("Connected to MQTT server");
    } else {
      Serial.print("MQTT connection failed with error code ");
      Serial.println(mqttClient.state());
    }
  }

  StaticJsonDocument<256> doc;
  doc["alert"] = "ON";
  doc["IP"] = remoteip;

  String message;
  serializeJson(doc, message);

  Serial.println("Publishing MQTT message:");
  Serial.println(message);

  // Publish the MQTT message
  mqttClient.publish(mqttTopic, message.c_str());
  delay(200);
  mqttClient.disconnect();
}

void FtpServer::clientConnected()
{
#ifdef FTP_DEBUG
  Serial.println("Client connected!");
#endif
  client.println( "220--- Welcome to FTP ---");
  client.println( "220 --   Version " + String(FTP_SERVER_VERSION) + "   --");
  iCL = 0;
}

