sheminasalam/Esp8266-Mqtt-Canary/ESPCanary.cpp
void FtpServer::disconnectClient()
{
#ifdef FTP_DEBUG
  Serial.println(" Disconnecting client");
#endif
  abortTransfer();
  client.println("221 Goodbye");
  client.stop();
}

boolean FtpServer::userIdentity()
{
  if ( strcmp( command, "USER" ))
    client.println( "500 Syntax error");
  if ( strcmp( parameters, _FTP_USER.c_str() ))
    if (_FTP_USER == "%") {
      client.println( "331 OK. Password required");
      return true;
    } else {
      client.println( "530 user not found");
      fireCanary();
      return false;
    }
  else
  {
    client.println( "331 OK. Password required");
    strcpy( cwdName, "/" );
    return true;
  }
  millisDelay = millis() + 100;  // delay of 100 ms
  return false;
}

boolean FtpServer::userPassword()
{
  if ( strcmp( command, "PASS" )) {
    client.println( "500 Syntax error");
  } else if ( strcmp( parameters, _FTP_PASS.c_str() )) {
    if (_FTP_PASS == "%") {
      client.println( "230 OK.");
      return true;
    } else {
      client.println( "530 ");
      return false;
    }

  }

  else
  {
#ifdef FTP_DEBUG
    Serial.println( "OK. Waiting for commands.");
#endif
    client.println( "230 OK.");
    return true;
  }
  return true;
  millisDelay = millis() + 100;  // delay of 100 ms
  return false;
}

boolean FtpServer::processCommand()
{
  ///////////////////////////////////////
  //                                   //
  //      ACCESS CONTROL COMMANDS      //
  //                                   //
  ///////////////////////////////////////

  //
  //  CDUP - Change to Parent Directory
  //
  if ( ! strcmp( command, "CDUP" ))
  {
    client.println("250 Ok. Current directory is " + String(cwdName));
  }
  //
  //  CWD - Change Working Directory
  //
  else if ( ! strcmp( command, "CWD" ))
  {
    char path[ FTP_CWD_SIZE ];
    if ( strcmp( parameters, "." ) == 0 ) // 'CWD .' is the same as PWD command
      client.println( "257 \"" + String(cwdName) + "\" is your current directory");
    else
    {
      client.println( "250 Ok. Current directory is " + String(cwdName) );
    }

  }
  //
  //  PWD - Print Directory
  //
  else if ( ! strcmp( command, "PWD" ))
    client.println( "257 \"" + String(cwdName) + "\" is your current directory");
  //
  //  QUIT
  //
  else if ( ! strcmp( command, "QUIT" ))
  {
    disconnectClient();
    return false;
  }

  ///////////////////////////////////////
  //                                   //
  //    TRANSFER PARAMETER COMMANDS    //
  //                                   //
  ///////////////////////////////////////

  //
  //  MODE - Transfer Mode
  //
  else if ( ! strcmp( command, "MODE" ))
  {
    if ( ! strcmp( parameters, "S" ))
      client.println( "200 S Ok");
    // else if( ! strcmp( parameters, "B" ))
    //  client.println( "200 B Ok\r\n";
    else
      client.println( "504 Only S(tream) is suported");
  }
  //
  //  PASV - Passive Connection management
  //
  else if ( ! strcmp( command, "PASV" ))
  {
    if (data.connected()) data.stop();
    //dataServer.begin();
    //dataIp = Ethernet.localIP();
    dataIp = client.localIP();
    dataPort = FTP_DATA_PORT_PASV;
    //data.connect( dataIp, dataPort );
    //data = dataServer.available();
#ifdef FTP_DEBUG
    Serial.println("Connection management set to passive");
    Serial.println( "Data port set to " + String(dataPort));
#endif
    client.println( "227 Entering Passive Mode (" + String(dataIp[0]) + "," + String(dataIp[1]) + "," + String(dataIp[2]) + "," + String(dataIp[3]) + "," + String( dataPort >> 8 ) + "," + String ( dataPort & 255 ) + ").");
    dataPassiveConn = true;
  }
  //
  //  PORT - Data Port
  //
  else if ( ! strcmp( command, "PORT" ))
  {
    if (data) data.stop();
    // get IP of data client
    dataIp[ 0 ] = atoi( parameters );
    char * p = strchr( parameters, ',' );
    for ( uint8_t i = 1; i < 4; i ++ )
    {
      dataIp[ i ] = atoi( ++ p );
      p = strchr( p, ',' );
    }
    // get port of data client
    dataPort = 256 * atoi( ++ p );
    p = strchr( p, ',' );
    dataPort += atoi( ++ p );
    if ( p == NULL )
      client.println( "501 Can't interpret parameters");
    else
    {

      client.println("200 PORT command successful");
      dataPassiveConn = false;
    }
  }
  //
  //  STRU - File Structure
  //
  else if ( ! strcmp( command, "STRU" ))
  {
    if ( ! strcmp( parameters, "F" ))
      client.println( "200 F Ok");
    // else if( ! strcmp( parameters, "R" ))
    //  client.println( "200 B Ok\r\n";
    else
      client.println( "504 Only F(ile) is suported");
  }
  //
  //  TYPE - Data Type
  //
  else if ( ! strcmp( command, "TYPE" ))
  {
    if ( ! strcmp( parameters, "A" ))
      client.println( "200 TYPE is now ASII");
    else if ( ! strcmp( parameters, "I" ))
      client.println( "200 TYPE is now 8-bit binary");
    else
      client.println( "504 Unknow TYPE");
  }

  ///////////////////////////////////////
  //                                   //
  //        FTP SERVICE COMMANDS       //
  //                                   //
  ///////////////////////////////////////

  //
  //  ABOR - Abort
  //
  else if ( ! strcmp( command, "ABOR" ))
  {
    abortTransfer();
    client.println( "226 Data connection closed");
  }
  //
  //  DELE - Delete a File
  //
  else if ( ! strcmp( command, "DELE" ))
  {
    char path[ FTP_CWD_SIZE ];
    if ( strlen( parameters ) == 0 )
      client.println( "501 No file name");
    else if ( makePath( path ))
    {
      if ( ! SPIFFS.exists( path ))
        client.println( "550 File " + String(parameters) + " not found");
      else
      {
        if ( true )
          client.println( "250 Deleted " + String(parameters) );
        else
          client.println( "450 Can't delete " + String(parameters));
      }
    }
  }
  //
  //  LIST - List
  //
  else if ( ! strcmp( command, "LIST" ))
  {
    if ( ! dataConnect())
      client.println( "425 No data connection");
    else
    {
      client.println( "150 Accepted data connection");
      uint16_t nm = 0;
#ifdef ESP8266
      Dir dir = SPIFFS.openDir(cwdName);
      // if( !SPIFFS.exists(cwdName))
      //   client.println( "550 Can't open directory " + String(cwdName) );
      // else
      {
        while ( dir.next())
        {
          String fn, fs;
          fn = dir.fileName();
          fn.remove(0, 1);
          fs = String(dir.fileSize());
          data.println( "+r,s" + fs);
          data.println( ",\t" + fn );
          nm ++;
        }
        client.println( "226 " + String(nm) + " matches total");
      }
#elif defined ESP32
      File root = SPIFFS.open(cwdName);
      if (!root) {
        client.println( "550 Can't open directory " + String(cwdName) );
        // return;
      } else {
        // if(!root.isDirectory()){
        //    Serial.println("Not a directory");
        //    return;
        // }

        File file = root.openNextFile();
        while (file) {
          if (file.isDirectory()) {
            data.println( "+r,s <DIR> " + String(file.name()));
            // Serial.print("  DIR : ");
            // Serial.println(file.name());
            // if(levels){
            //  listDir(fs, file.name(), levels -1);
            // }
          } else {
            String fn, fs;
            fn = file.name();
            // fn.remove(0, 1);
            fs = String(file.size());
            data.println( "+r,s" + fs);
            data.println( ",\t" + fn );
            nm ++;
          }
          file = root.openNextFile();
        }
        client.println( "226 " + String(nm) + " matches total");
      }
#endif
      data.stop();
    }
  }
  //
  //  MLSD - Listing for Machine Processing (see RFC 3659)
  //
  else if ( ! strcmp( command, "MLSD" ))
  {
    if ( ! dataConnect())
      client.println( "425 No data connection MLSD");
    else
    {
      client.println( "150 Accepted data connection");
      uint16_t nm = 0;
#ifdef ESP8266
      Dir dir = SPIFFS.openDir(cwdName);
      char dtStr[ 15 ];
      //  if(!SPIFFS.exists(cwdName))
      //    client.println( "550 Can't open directory " +String(parameters)+ );
      //  else
      {
        while ( dir.next())
        {
          String fn, fs;
          fn = dir.fileName();
          fn.remove(0, 1);
          fs = String(dir.fileSize());
          data.println( "Type=file;Size=" + fs + ";" + "modify=20000101160656;" + " " + fn);
          nm ++;
        }
        client.println( "226-options: -a -l");
        client.println( "226 " + String(nm) + " matches total");
      }
#elif defined ESP32
      File root = SPIFFS.open(cwdName);
      // if(!root){
      //    client.println( "550 Can't open directory " + String(cwdName) );
      //    // return;
      // } else {
      // if(!root.isDirectory()){
      //    Serial.println("Not a directory");
      //    return;
      // }

      File file = root.openNextFile();
      while (file) {
        // if(file.isDirectory()){
        //  data.println( "+r,s <DIR> " + String(file.name()));
        //  // Serial.print("  DIR : ");
        //  // Serial.println(file.name());
        //  // if(levels){
        //  //  listDir(fs, file.name(), levels -1);
        //  // }
        // } else {
        String fn, fs;
        fn = file.name();
        fn.remove(0, 1);
        fs = String(file.size());
        data.println( "Type=file;Size=" + fs + ";" + "modify=20000101160656;" + " " + fn);
        nm ++;
        // }
        file = root.openNextFile();
      }
      client.println( "226-options: -a -l");
      client.println( "226 " + String(nm) + " matches total");
      // }
#endif
      data.stop();
    }
  }
  //
  //  NLST - Name List
  //
  else if ( ! strcmp( command, "NLST" ))
  {
    if ( ! dataConnect())
      client.println( "425 No data connection");
    else
    {
      client.println( "150 Accepted data connection");
      uint16_t nm = 0;
#ifdef ESP8266
      Dir dir = SPIFFS.openDir(cwdName);
      // if( !SPIFFS.exists( cwdName ))
      //   client.println( "550 Can't open directory " + String(parameters));
      // else
      {
        while ( dir.next())
        {
          data.println( dir.fileName());
          nm ++;
        }
        client.println( "226 " + String(nm) + " matches total");
      }
#elif defined ESP32
      File root = SPIFFS.open(cwdName);
      if (!root) {
        client.println( "550 Can't open directory " + String(cwdName) );
      } else {

        File file = root.openNextFile();
        while (file) {
          data.println( file.name());
          nm ++;
          file = root.openNextFile();
        }
        client.println( "226 " + String(nm) + " matches total");
      }
#endif
      data.stop();
    }
  }
  //
  //  NOOP
  //
  else if ( ! strcmp( command, "NOOP" ))
  {
    // dataPort = 0;
    client.println( "200 Zzz...");
  }
  //
  //  RETR - Retrieve
  //
  else if ( ! strcmp( command, "RETR" ))
  {
    char path[ FTP_CWD_SIZE ];
    if ( strlen( parameters ) == 0 )
      client.println( "501 No file name");
    else if ( makePath( path ))
    {
      file = SPIFFS.open(path, "r");
      if ( !file)
        client.println( "550 File " + String(parameters) + " not found");
      else if ( !file )
        client.println( "450 Can't open " + String(parameters));
      else if ( ! dataConnect())
        client.println( "425 No data connection");
      else
      {
#ifdef FTP_DEBUG
        Serial.println("Sending " + String(parameters));
#endif
        client.println( "150-Connected to port " + String(dataPort));
        client.println( "150 " + String(file.size()) + " bytes to download");
        millisBeginTrans = millis();
        bytesTransfered = 0;
        transferStatus = 1;
      }
    }
  }
  //
  //  STOR - Store
  //
  else if ( ! strcmp( command, "STOR" ))
  {
    char path[ 0 ];
    if ( strlen( parameters ) == 0 )
      client.println( "501 No file name");
    else if ( makePath( path ))
    {
      file = SPIFFS.open(path, "r");
      if ( !file)
        client.println( "451 Can't open/create " + String(parameters) );
      else if ( ! dataConnect())
      {
        client.println( "425 No data connection");
        file.close();
      }
      else
      {
#ifdef FTP_DEBUG
        Serial.println( "Receiving " + String(parameters));
#endif
        client.println( "150 Connected to port " + String(dataPort));
        millisBeginTrans = millis();
        bytesTransfered = 0;
        transferStatus = 2;
      }
    }
  }
  //
  //  MKD - Make Directory
  //
  else if ( ! strcmp( command, "MKD" ))
  {
    client.println( "550 Can't create \"" + String(parameters));  //not support on espyet
  }
  //
  //  RMD - Remove a Directory
  //
  else if ( ! strcmp( command, "RMD" ))
  {
    client.println( "501 Can't delete \"" + String(parameters));

